Revit 2027 API
View3D.GetSectionBox Method
 Gets a copy of the section box for this 3D view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundingBoxXYZ GetSectionBox()
Public Function GetSectionBox As BoundingBoxXYZ
public:
BoundingBoxXYZ^ GetSectionBox()
member GetSectionBox : unit -> BoundingBoxXYZ
Return Value
BoundingBoxXYZ
 The section box. Note that the section box can be rotated and transformed and thus you will need to use [!:Autodesk::Revit::DB::BoundingBoxXYZ::Transform] to interpret the coordinates of the corners or sides of the box in model coordinates.
Exceptions
Exception | Condition
InvalidOperationException |  Returns true if the view is not a view template.
Remarks
 The section box cuts the model in this view by its boundaries.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace